{
  "frontend": "Frontend Utvikler",
  "Home": "Hjem",
  "About": "Om Meg",
  "Projects": "Prosjekter",
  "Connect": "Kontakt",
  "connectWithMe": "Ta kontakt!",
  "Language": "Språk",
  "aboutMe": "Om Meg",
  "aboutMeText": "Hei! Mitt navn er Hans Marius, men på nettet er jeg kjent som Spookyrumble. Jeg er en lidenskapelig og dedikert person som setter stor pris på både teknologi og menneskelige relasjoner.\n\nEn av mine største interesser er biler, motorsykler og Formel 1. Jeg elsker spenningen og teknologien som ligger bak motorsport, og jeg bruker mye tid på å holde meg oppdatert om alt som skjer innenfor denne fascinerende verdenen.\n\nFor meg er folkeskikk og respekt for andre svært viktig. Jeg mener at man alltid skal være forsiktig med å anta hva andre har gått igjennom. Dette gjør at jeg er en objektiv og forståelsesfull person som alltid forsøker å se ting fra andres perspektiv. Jeg tror på at folk flest er gode mennesker og at alle fortjener respekt.\n\nSelv om jeg er en ganske privat person, er jeg veldig åpen med min indre sirkel av venner og familie. Mine barn er en stor inspirasjon for meg. Jeg lærer mye av å observere hvordan de tilnærmer seg verden med nysgjerrighet og åpenhet. Deres uforbeholdne syn på livet gir meg motivasjon til å alltid strebe etter å være en bedre versjon av meg selv.\n\nVenner vil beskrive meg som nysgjerrig, motivert og alltid klar til å hjelpe til. Jeg tror på kontinuerlig læring og streber etter å forbedre meg selv hver dag, enten det er å mestre et nytt programmeringsspråk eller utforske en ny hobby. Jeg drives av et ønske om å innovere og gjøre en positiv innvirkning gjennom teknologi.",
  "careerBackground": "Yrke og Bakgrunn",
  "careerBackgroundText": "Jeg en proaktiv frontend-utvikler med en lidenskap for å bidra med innovative løsninger og styrke dynamiske team. For tiden jobber jeg som studentmentor ved Noroff Fagskole, hvor jeg har muligheten til å styrke studenters motivasjon og engasjement gjennom tilpassede mentorstiler. Denne rollen har gitt meg verdifull erfaring i å motivere og veilede studenter.\n\nTidligere har jeg jobbet som bilpleietekniker og kunderådgiver hos Laastad & Co, hvor jeg blant annet var kvalifisert i lakk-konservering og påføring av keramisk coating. Jeg har også erfaring som kunderådgiver hos Tollaksen Autoservice AS, hvor jeg var primær kontaktpunkt for verkstedskunder og ansvarlig for nøyaktig ordrebehandling og oppfølging.\n\nMin erfaring inkluderer også rollen som servicekoordinator hos Hybeko-Forland AS, hvor jeg ledet kundekontakt og arbeidsplanlegging for service teamet, samt som kunderådgiver hos Motorforum Bergen AS, hvor jeg drev salgsstøtte og optimaliserte inntektsstrøm gjennom nøyaktig fakturering og dagplanlegging. Disse rollene har gitt meg et bredt spekter av ferdigheter innen kundeservice, ordrebehandling og teamledelse.",
  "educationSkills": "Utdanning og Ferdigheter",
  "educationSkillsText": "Jeg har en høyere fagskolegrad i frontend-utvikling fra Noroff - School of Technology and Digital Media, hvor jeg har kombinert visuell design med koding, webutvikling og UX-design. Min utdanning har gitt meg en solid forståelse for hvordan man kombinerer estetikk og funksjonalitet i webdesign, og jeg har utmerket meg i koding og UX-design med fokus på brukervennlige løsninger.\n\nFerdighetene mine inkluderer frontend-utvikling, kundeservice og bilvedlikehold. Jeg er også flytende i både norsk og engelsk. Gjennom min utdanning og yrkeserfaring har jeg utviklet evnen til å arbeide effektivt både i team og selvstendig, og jeg er alltid på utkikk etter muligheter til å vokse faglig og utvikle dybdekunnskaper i et samarbeidsorientert arbeidsmiljø.",
  "interestsHobbies": "Interesser og Hobbyer",
  "interestsHobbiesText": "Jeg elsker å reise og har besøkt alle kontinenter bortsett fra Antarktis og Sør-Amerika. Jeg finner stor glede i å utforske nye kulturer og matretter, noe som har utvidet mitt perspektiv og beriket livet mitt. Elgjakt er en favorittaktivitet, som ikke bare gir en spennende utfordring, men også en mulighet til å komme i kontakt med naturen på et dypere nivå. Jeg pleide å snowboarde mye, og jeg nøt spenningen og friheten av å gli ned snødekte bakker.\n\nNå til dags bruker jeg mye av tiden min på teknologi, gaming og koding. Jeg er dypt engasjert i å skape innovative løsninger og stadig forbedre mine ferdigheter innen frontend-utvikling. Gaming er en annen betydelig interesse, med en spesiell forkjærlighet for rollespill og strategispill som tilbyr komplekse verdener og intrikate narrativer. Jeg er også en stor fan av Star Wars og Marvel-filmer, og jeg setter pris på deres rike historier og omfattende universer. I tillegg liker jeg å tilbringe tid med familien min og våre to hunder, og vi drar ofte på turer og utendørseventyr. Mine hobbyer reflekterer min kjærlighet for både eventyr og kreativitet, og balanserer fysiske aktiviteter med intellektuelle sysler.",
  "personalityWorkStyle": "Personlighet og Arbeidsstil",
  "personalityWorkStyleText": "Jeg er en person som verdsetter integritet og ærlighet i alle aspekter av livet. Jeg tror sterkt på at god folkeskikk og respekt er fundamentale verdier som fremmer positive relasjoner både på arbeidsplassen og i privatlivet. Denne tilnærmingen gjør meg til en empatisk og forståelsesfull kollega som alltid er villig til å lytte og bidra konstruktivt i ethvert samarbeid.\n\nNår det kommer til min arbeidsstil, er jeg svært detaljorientert og metodisk. Jeg liker å jobbe strukturert og planlegger alltid grundig for å sikre at jeg leverer høy kvalitet i alt jeg gjør. Min bakgrunn som frontend-utvikler har lært meg viktigheten av både estetikk og funksjonalitet, og jeg streber etter å finne balansen mellom disse to aspektene i arbeidet mitt.\n\nJeg trives godt i dynamiske team der kreativitet og innovasjon oppmuntres. Samtidig har jeg evnen til å jobbe selvstendig og ta ansvar for egne prosjekter. Jeg er alltid på jakt etter nye utfordringer og læringsmuligheter, og jeg setter stor pris på et arbeidsmiljø der kontinuerlig faglig utvikling er en prioritet. Mine kolleger beskriver meg som pålitelig, nysgjerrig og alltid klar for å finne kreative løsninger på komplekse problemer.",
  "goalsAmbitions": "Mål og Ambisjoner",
  "goalsAmbitionsText": "Mine mål og ambisjoner er drevet av et ønske om kontinuerlig utvikling og å gjøre en positiv forskjell gjennom teknologi. På kort sikt ønsker jeg å videreutvikle mine ferdigheter som frontend-utvikler og bidra til innovative prosjekter som kan forbedre brukeropplevelser og løse komplekse problemer. Jeg ser frem til å ta på meg utfordrende oppgaver som kan hjelpe meg å vokse både faglig og personlig.\n\nPå lang sikt har jeg ambisjoner om å ta på meg lederroller der jeg kan inspirere og veilede andre utviklere. Jeg ønsker å skape et miljø der teamet kan blomstre og hvor kreativitet og nyskaping står i fokus. En annen langsiktig ambisjon er å bidra til samfunnsnyttige prosjekter, særlig de som kan gjøre teknologi tilgjengelig og nyttig for flere mennesker. Jeg er spesielt interessert i å arbeide med prosjekter som fremmer bærekraft og samfunnsansvar.\n\nMin ultimate drøm er å være en del av et selskap eller en organisasjon som ligger i forkant av teknologisk innovasjon, hvor jeg kan fortsette å lære og vokse i et dynamisk og støttende miljø. Jeg er motivert av tanken på å kunne bruke mine ferdigheter til å gjøre en reell forskjell og bidra til en bedre fremtid gjennom teknologi.",
  "motto": "Motto",
  "mottoText": "'I don't deal the cards, I just play them.' Dette sitatet er ofte brukt i sammenhenger der man gjør det beste ut av situasjoner man ikke har kontroll over.\n\n'It's better to be a warrior in a garden than a gardener in a war.' Dette sitatet, ofte tilskrevet Bruce Lee, reflekterer filosofien om å være forberedt og sterk, selv i tider med fred.",
  "gallery": "Galleri",
  "welcome": "Velkommen til min hjemmeside!",
  "welcomeText": "Jeg er en entusiastisk og dedikert person, med spesialisering i frontend utvikling.\n\nJeg håper du finner informasjonen her nyttig og engasjerende. Føl deg fri til å utforske.",
  "thankYou": "Takk for at du kom!",
  "builtWith": "Bygget med",
  "links": "Lenker",
  "rainydays": {
    "description": "Det første prosjektet fra skolen som vi jobbet med det første året. Oppgaven var å lage en nettside for en fiktiv bedrift som solgte regntøy."
  },
  "csm": {
    "description": "For dette prosjektet fikk vi i oppgave å designe og utvikle en nettside for samfunnsvitenskapsmuseet. Målgruppen var barn i alderen 7-15 år. Vi fikk tekst og bilder, men farger, skrifttyper og design var opp til oss å lage og designe. Jeg valgte en fargepalett som gikk for et mørkt tema, men også med lyse og livlige farger, og for skrifttyper ønsket jeg å gå litt annerledes, så jeg parret Alegreya med Nunito med inspirasjon fra Figma-samfunnet."
  },
  "itt": {
    "description": "Dette er eksamensprosjektet mitt for det første året med frontend-utviklingsstudier. Det er en bloggside laget for dette formålet, og alt du leser og ser er fiktivt. Denne siden bruker WordPress REST API for å hente innholdet sitt. Dette prosjektet er laget for å vise frem ferdighetene og evnene vi har oppnådd i løpet av dette første året med studier."
  },
  "connotation": {
    "description": "Dette prosjektet er en utvidelse av en Bootstrap-oppgave der vi har integrert JavaScript for å forbedre funksjonaliteten til et sosialt medie-nettsted. Den opprinnelige oppgaven brukte primært Bootstrap, og vi har utvidet den ved å inkludere JavaScript-funksjoner.",
    "demoNotes": "NB! Krever login. Bruk e-post: invitedguest@noroff.no, Passord: socialmedia"
  },
  "cyberstore": {
    "description": "Min første introduksjon til å bygge med React. Stylet med Styled-Components.",
    "demoNotes": "NB! Krever login. Bruk e-post: invitedguest@noroff.no, Passord: auctionhouse"
  },
  "adling": {
    "description": "Et morsomt prosjekt med en bot som henter stillingsannonser fra en nettside og legger dem ut på en Discord-server.",
    "demoNotes": "Satt opp for å fungere på min Discord-server. Vennligst les README.md for mer informasjon."
  },
  "flutter": {
    "description": "Et Pong-lignende spill jeg bygde med Flutter.",
    "demoNotes": "Krever nedlasting og utpakking av zip-filen. Kjør .exe-filen for å spille spillet."
  },
  "havens": {
    "description": "Havens er et prosjekt utviklet som en del av eksamen i Front-End Development. Prosjektet har som mål å demonstrere ferdigheter i webutvikling ved bruk av moderne verktøy og rammeverk, og å anvende ferdighetene lært over de siste to årene i et omfattende prosjekt.",
    "demoNotes": "NB! Krever innlogging. Bruk e-post: invitedguest@stud.noroff.no, Passord: 1Havenshavens"
  }
}
