{
  "frontend": "Frontend Utvikler",
  "Home": "Hjem",
  "About": "Om Meg",
  "Projects": "Prosjekter",
  "Connect": "Kontakt",
  "connectWithMe": "Ta kontakt!",
  "Language": "Språk",
  "aboutMe": "Om Meg",
  "aboutMeText": "Hei! Mitt navn er Hans Marius, men på nettet er jeg kjent som Spookyrumble. Jeg er en lidenskapelig og dedikert person som setter stor pris på både teknologi og menneskelige relasjoner.\n\nSelv om jeg er en ganske privat person, er jeg veldig åpen med min indre sirkel av venner og familie. Mine barn er en stor inspirasjon for meg. Jeg lærer mye av å observere hvordan de tilnærmer seg verden med nysgjerrighet og åpenhet. Deres uforbeholdne syn på livet gir meg motivasjon til å alltid strebe etter å være en bedre versjon av meg selv.\n\nVenner vil beskrive meg som nysgjerrig, motivert og alltid klar til å hjelpe til. Jeg tror på kontinuerlig læring og streber etter å forbedre meg selv hver dag, enten det er å mestre et nytt programmeringsspråk eller utforske en ny hobby. Jeg drives av et ønske om å innovere og gjøre en positiv innvirkning gjennom teknologi.",
  "careerBackground": "Yrke og Bakgrunn",
  "careerBackgroundText": "Jeg er en proaktiv frontend-utvikler med en lidenskap for å bidra med innovative løsninger og styrke dynamiske team. For tiden jobber jeg som studentmentor ved Noroff School of Technology and Digital Media, hvor jeg har muligheten til å øke studentenes motivasjon og engasjement gjennom skreddersydde mentorstiler. Denne rollen har gitt meg verdifull erfaring i å motivere og veilede studenter.\n\nJeg har et skarpt øye for detaljer og utmerker meg i å identifisere feil og mangler, ferdigheter jeg har utviklet gjennom erfaring med bilpleie. Min bakgrunn innen kundeservice har utstyrt meg med utmerkede kommunikasjonsferdigheter, evnen til å håndtere kundeforhold effektivt, samt en talent for nøyaktig ordrebehandling og oppfølging.\n\nI tillegg har jeg erfaring med å koordinere serviceteam og planlegge arbeid effektivt, noe som har styrket mine ledelses- og organisatoriske evner. Mine roller i ulike kundevendte stillinger har også utviklet min evne til å gi salgssupport, optimalisere inntektsstrømmer gjennom presis fakturering, og sikre sømløs daglig drift. Disse erfaringene har samlet sett gitt meg et allsidig ferdighetssett innen kundeservice, ordrebehandling og teamledelse.",
  "educationSkills": "Utdanning og Ferdigheter",
  "educationSkillsText": "Jeg har en høyere fagskolegrad i frontend-utvikling fra Noroff - School of Technology and Digital Media, hvor jeg har kombinert visuell design med koding, webutvikling og UX-design. Min utdanning har gitt meg en solid forståelse for hvordan man kombinerer estetikk og funksjonalitet i webdesign, og jeg har utmerket meg i koding og UX-design med fokus på brukervennlige løsninger.\n\nGjennom min utdanning og yrkeserfaring har jeg utviklet evnen til å arbeide effektivt både i team og selvstendig, og jeg er alltid på utkikk etter muligheter til å vokse faglig og utvikle dybdekunnskaper i et samarbeidsorientert arbeidsmiljø. Morsmål er norsk og jeg snakker engelsk flytende",
  "interestsHobbies": "Interesser og Hobbyer",
  "interestsHobbiesText": "Jeg elsker å reise og har besøkt alle kontinenter bortsett fra Antarktis og Sør-Amerika. Jeg finner stor glede i å utforske nye kulturer og matretter, noe som har utvidet mitt perspektiv og beriket livet mitt.\n\nEn av mine største interesser er biler, motorsykler og Formel 1. Jeg elsker spenningen og teknologien som ligger bak motorsport, og jeg bruker mye tid på å holde meg oppdatert om alt som skjer innenfor denne fascinerende verdenen. Jakt og spesielt elgjakt er en favorittaktivitet, som ikke bare gir en spennende utfordring, men også en mulighet til å komme i kontakt med naturen på et dypere nivå.\n\nNå til dags bruker jeg mye av tiden min på teknologi, gaming og koding. Jeg er dypt engasjert i å skape innovative løsninger og stadig forbedre mine ferdigheter innen frontend-utvikling. Gaming er en annen betydelig interesse, med en spesiell forkjærlighet for rollespill og strategispill som tilbyr komplekse verdener og intrikate narrativer. Jeg er også en stor fan av Star Wars og Marvel-filmer, og jeg setter pris på deres rike historier og omfattende universer. I tillegg liker jeg å tilbringe tid med familien min og våre to hunder, og vi drar ofte på turer og utendørseventyr. Mine hobbyer reflekterer min kjærlighet for både eventyr og kreativitet, og balanserer fysiske aktiviteter med intellektuelle sysler.",
  "personalityWorkStyle": "Personlighet og Arbeidsstil",
  "personalityWorkStyleText": "Jeg er en person som verdsetter integritet og ærlighet i alle aspekter av livet. Jeg tror sterkt på at god folkeskikk og respekt er fundamentale verdier som fremmer positive relasjoner både på arbeidsplassen og i privatlivet. Denne tilnærmingen gjør meg til en empatisk og forståelsesfull kollega som alltid er villig til å lytte og bidra konstruktivt i ethvert samarbeid.\n\nNår det kommer til min arbeidsstil, er jeg svært detaljorientert og metodisk. Jeg liker å jobbe strukturert og planlegger alltid grundig for å sikre at jeg leverer høy kvalitet i alt jeg gjør. Min bakgrunn som frontend-utvikler har lært meg viktigheten av både estetikk og funksjonalitet, og jeg streber etter å finne balansen mellom disse to aspektene i arbeidet mitt.\n\nJeg trives godt i dynamiske team der kreativitet og innovasjon oppmuntres. Samtidig har jeg evnen til å jobbe selvstendig og ta ansvar for egne prosjekter. Jeg er alltid på jakt etter nye utfordringer og læringsmuligheter, og jeg setter stor pris på et arbeidsmiljø der kontinuerlig faglig utvikling er en prioritet. Mine kolleger beskriver meg som pålitelig, nysgjerrig og alltid klar for å finne kreative løsninger på komplekse problemer.",
  "goalsAmbitions": "Mål og Ambisjoner",
  "goalsAmbitionsText": "Mine mål og ambisjoner er drevet av et ønske om kontinuerlig utvikling og å gjøre en positiv innvirkning gjennom teknologi. På kort sikt ønsker jeg å videreutvikle mine ferdigheter som front-end utvikler og bidra til innovative prosjekter som kan forbedre brukeropplevelser og løse komplekse problemer. Jeg ser frem til å ta på meg utfordrende oppgaver som kan hjelpe meg å vokse både profesjonelt og personlig.\n\nJeg har en sterk interesse for kunstig intelligens (AI) og er ivrig etter å lære mer om dette feltet. Jeg tror AI har potensial til å revolusjonere mange aspekter av våre liv, og jeg vil være i forkant av denne teknologiske utviklingen. Mitt mål er å integrere AI i mitt arbeid, og skape smartere og mer effektive løsninger.\n\nPå lang sikt ønsker jeg å ta på meg lederroller hvor jeg kan inspirere og veilede andre utviklere. Jeg vil skape et miljø hvor teamet kan trives, med et sterkt fokus på kreativitet og innovasjon. En annen langsiktig ambisjon er å bidra til samfunnsnyttige prosjekter, spesielt de som gjør teknologi tilgjengelig og nyttig for flere mennesker. Jeg er spesielt interessert i å jobbe med prosjekter som fremmer bærekraft og sosialt ansvar.\n\nMin ultimate drøm er å være en del av et selskap eller en organisasjon i forkant av teknologisk innovasjon, hvor jeg kan fortsette å lære og vokse i et dynamisk og støttende miljø. Jeg er motivert av tanken på å bruke mine ferdigheter til å gjøre en reell forskjell og bidra til en bedre fremtid gjennom teknologi.",
  "motto": "Motto",
  "mottoText": "'I don't deal the cards, I just play them.' - Dette sitatet er ofte brukt i sammenhenger der man gjør det beste ut av situasjoner man ikke har kontroll over.\n\n'It's better to be a warrior in a garden than a gardener in a war.' - Dette sitatet, ofte tilskrevet Bruce Lee, reflekterer filosofien om å være forberedt og sterk, selv i tider med fred.",
  "gallery": "Galleri",
  "welcome": "Velkommen!",
  "welcomeText": "På denne siden finner du en oversikt over mine prosjekter, ferdigheter og erfaringer. Du kan lære om min bakgrunn, mine mål og fremtidsplaner.\n\nIkke nøl med å ta kontakt hvis du har noen spørsmål eller er interessert i samarbeid!",
  "explore": "Utforsk",
  "builtWith": "Bygget med",
  "links": "Lenker",
  "keyFeaturesHeader": "Nøkkelfunksjoner",
  "rainydays": {
    "description": "Det første prosjektet fra skolen som vi jobbet med i første året. Oppgaven var å lage en nettside for et fiktivt selskap som solgte regntøy.",
    "keyFeatures": [
      "Førsteårs skoleprosjekt",
      "Nettside for et fiktivt regntøyselskap",
      "Fokus på grunnleggende webutvikling"
    ]
  },
  "csm": {
    "description": "For dette prosjektet ble vi bedt om å designe og utvikle en nettside for samfunnsvitenskapsmuseet. Målgruppen var barn i alderen 7-15 år. Vi fikk tekst og bilder, men farger, skrifttyper og design var opp til oss å lage og designe. Jeg valgte en fargepalett med en mørk tema, men også med lyse og levende farger, og for skrifttyper ønsket jeg å være litt annerledes, så jeg kombinerte Alegreya med Nunito med inspirasjon fra Figma-samfunnet.",
    "keyFeatures": [
      "Nettside for samfunnsvitenskapsmuseet",
      "Målgruppe: 7-15 år",
      "Egendefinert fargepalett og skriftvalg",
      "Mørkt tema med lyse og levende farger",
      "Skrifttyper: Alegreya og Nunito"
    ]
  },
  "itt": {
    "description": "Dette er mitt eksamensprosjekt for mitt første år med frontend-utviklingsstudier. Det er en bloggside laget for denne grunnen, og alt du leser og ser er fiktivt. Denne siden bruker WordPress REST API for å hente innholdet sitt. Dette prosjektet er laget for å vise frem ferdighetene og evnene vi har tilegnet oss i løpet av dette første året med studier.",
    "keyFeatures": [
      "Førsteårs eksamensprosjekt",
      "Bloggside",
      "Bruker WordPress REST API",
      "Viser frem tilegnede ferdigheter og evner",
      "Kommentering"
    ]
  },
  "connotation": {
    "description": "Dette prosjektet er en utvidelse av en Bootstrap-oppgave hvor vi har integrert JavaScript for å forbedre funksjonaliteten til en sosial medieside. Den opprinnelige oppgaven brukte primært Bootstrap, og vi har utvidet den ved å inkludere JavaScript-funksjoner.",
    "demoNotes": "NB! Krever innlogging. Bruk e-post: invitedguest@noroff.no, Passord: socialmedia",
    "keyFeatures": [
      "Bootstrap-oppgaveutvidelse",
      "Forbedret med JavaScript",
      "Sosial medieside funksjonalitet",
      "Krever innlogging for demo",
      "Kommentering",
      "Reaksjoner",
      "Følge/avfølge",
      "Publisering"
    ]
  },
  "onlypineapples": {
    "description": "En auksjonsside bygget med Bootstrap og SASS. Oppgaven var å lage en auksjonsside med budfunksjonalitet. Dette prosjektet inkluderer også enhetstesting med Jest og E2E-testing.",
    "demoNotes": "NB! Krever innlogging. Bruk e-post: invitedguest@noroff.no, Passord: auctionhouse",
    "keyFeatures": [
      "Auksjonsside",
      "Bygget med Bootstrap og SASS",
      "Inkluderer enhetstesting med Jest og E2E-testing",
      "Budfunksjonalitet",
      "Krever innlogging for demo",
      "Legg ut annonser",
      "Rediger profil"
    ]
  },
  "cyberstore": {
    "description": "Min første introduksjon til å bygge med React. Oppgaven var å lage en e-handelside som henter data med API og har alle funksjonaliteter en nettbutikk har, inkludert produktsøk og handlekurv. Dette prosjektet ga en grundig forståelse av React og dets økosystem. Stylet med Styled-Components for å sikre en moderne og responsiv design. Prosjektet krevde også håndtering av produktdata gjennom API-er.",
    "keyFeatures": [
      "Første prosjekt med React",
      "Stylet med Styled-Components",
      "Handlekurvfunksjonalitet",
      "Søkefunksjonalitet",
      "API-integrasjon"
    ]
  },
  "adling": {
    "description": "Her så jeg et behov for community-serveren jeg drifter. Jeg ville ha en kanal som viste nye jobber tilgjengelig innen utvikling, så jeg bygde denne boten for å gjøre nettopp dette. Det er teknisk sett en web scraper, men den henter bare åpen data og holder seg innenfor regler og regelverk. Den er konfigurert til å sjekke to ganger per dag. For å holde kontroll på dataen, lagrer den nye lenker til annonser i en JSON-fil som boten sjekker statusen på. Hvis de er nye, deles de, og 'posted' settes til false slik at de ikke deles mer enn én gang. Et script er laget for å rense gamle lenker etter et valgt tidsrom.",
    "demoNotes": "Satt opp for å fungere på min Discord-server. Vennligst les README.md for mer informasjon.",
    "keyFeatures": [
      "Bot for å hente jobbannonser",
      "Poster til en Discord-server",
      "Krever oppsett på Discord-server"
    ]
  },
  "flutter": {
    "description": "Et Pong-lignende spill jeg bygget ved bruk av Flutter. Dette var et sideprosjekt jeg gjorde privat i sammenheng med en case study vi gjorde for skolen.",
    "demoNotes": "Krever nedlasting og utpakking av zip-filen. Kjør .exe-filen for å spille spillet.",
    "keyFeatures": [
      "Pong-lignende spill",
      "Bygget ved bruk av Flutter",
      "Kjørbar fil for spilling"
    ]
  },
  "havens": {
    "description": "Havens er et ambisiøst prosjekt utviklet som en del av frontend development-eksamenen ved Noroff. Oppgaven var å bygge en applikasjon for overnatting, og prosjektet viser avansert ferdighet innen webutvikling ved bruk av moderne verktøy og rammeverk. Hovedmålet med Havens er å integrere ferdighetene og kunnskapen som er tilegnet de siste to årene til en omfattende og praktisk applikasjon. Dette prosjektet fremhever ikke bare evnen til å bygge responsive og brukervennlige grensesnitt, men også å demonstrere effektiv problemløsning, prosjektledelse, og anvendelse av beste praksis innen koding og design. Gjennom Havens er målet å skape en sømløs og engasjerende brukeropplevelse, som reflekterer kulminasjonen av omfattende læring og praktisk erfaring innen front-end utvikling.",
    "demoNotes": "NB! Krever innlogging. Bruk e-post: invitedguest@stud.noroff.no, Passord: 1Havenshavens",
    "keyFeatures": [
      "Front-End Development-eksamensprosjekt",
      "Demonstrerer ferdigheter i moderne webverktøy og rammeverk",
      "Omfattende prosjekt som viser to års ferdigheter",
      "Krever innlogging for demo",
      "Bestillingsfunksjonalitet",
      "Legg til lokaler",
      "Rediger lokaler",
      "Slett lokaler",
      "Vis og slett bestillinger på egne lokaler",
      "Vis lokaler på andre profiler",
      "Søkefunksjonalitet"
    ]
  }
}
