{
  "frontend": "Frontend Utvikler",
  "Home": "Hjem",
  "About": "Om Meg",
  "Projects": "Prosjekter",
  "Connect": "Kontakt",
  "connectWithMe": "Ta kontakt!",
  "Language": "Språk",
  "aboutMe": "Om Meg",
  "aboutMeText": "Hei! Mitt navn er Hans Marius, men på nettet er jeg kjent som Spookyrumble. Jeg er en entusiastisk og dedikert person som jobber deltid som studentmentor på Noroff, en jobb jeg fikk mens jeg studerte frontend-utvikling ved Noroff. Jeg har en lidenskap for teknologi og liker å løse komplekse problemer gjennom kreative kodingsløsninger.\n\nUtenom arbeid og studier er jeg en ivrig gamer, spesielt glad i rollespill og strategispill. Jeg elsker å fordype meg i nye spillverdener og oppleve deres historier og utfordringer. I tillegg til gaming liker jeg fotturer og å tilbringe tid i naturen, hvor jeg finner ro og inspirasjon.\n\nFamilie er en stor del av livet mitt. Jeg har en fantastisk kone, og sammen har vi tre barn og to hunder. Mye av tiden min går med til familien, hvor vi nyter aktiviteter og skaper minner sammen.\n\nVenner vil beskrive meg som nysgjerrig, motivert og alltid klar til å hjelpe til. Jeg tror på kontinuerlig læring og streber etter å forbedre meg selv hver dag, enten det er å mestre et nytt programmeringsspråk eller utforske en ny hobby. Jeg drives av et ønske om å innovere og gjøre en positiv innvirkning gjennom teknologi.",
  "careerBackground": "Yrke og Bakgrunn",
  "careerBackgroundText": "Jeg jobber for tiden som studentmentor ved Noroff, hvor jeg hjelper andre studenter med å navigere i sine studier og utvikle ferdigheter innen frontend-utvikling. I denne rollen har jeg utviklet sterke veilednings- og mentorferdigheter, og jeg har fått erfaring i å gi teknisk støtte og pedagogisk veiledning.\n\nJeg har også gjennomført flere kurs innen kunderådgivning, noe som har gitt meg verdifull erfaring med kundeservice og kommunikasjon. Tidligere har jeg jobbet i bilindustrien siden 2003, hvor jeg har hatt ulike roller, fra mekaniker og bildetaljer til kundeservice og deleavdelingen. Denne brede erfaringen har utviklet mine tekniske ferdigheter og evne til å håndtere komplekse problemer effektivt.\n\nMin erfaring i kundeservice har gjort meg i stand til å kommunisere effektivt med kunder, forstå deres behov og tilby løsninger som tilfredsstiller deres krav. Gjennom årene har jeg utviklet en sterk logisk og objektiv tilnærming til problemløsning, og jeg er dyktig til å feilsøke og finne løsninger på tekniske utfordringer.\n\nJeg er også nestleder i styret til datterens karateklubb, hvor vi har store planer for klubbens fremtid. Dette engasjementet har ytterligere styrket mine lederegenskaper og evne til å jobbe i team.",
  "educationSkills": "Utdanning og Ferdigheter",
  "educationSkillsText": "Jeg har en allmennfaglig bakgrunn og en høyere fagskolegrad i frontend-utvikling. Jeg har en logisk og objektiv tilnærming til problemløsning og er dyktig til å feilsøke og finne løsninger på tekniske utfordringer.\n\nJeg er også studentrepresentant for frontend-utvikling ved Noroff, hvor jeg representerer mine medstudenter og bidrar til forbedringer i studieprogrammet.",
  "interestsHobbies": "Interesser og Hobbyer",
  "interestsHobbiesText": "Jeg elsker å reise og har besøkt alle kontinenter bortsett fra Antarktis og Sør-Amerika. Elgjakt er en favorittaktivitet, og tidligere stod jeg mye på snowboard.\n\nNå bruker jeg mye tid på teknologi, gaming og koding. Jeg er også en stor fan av Star Wars og Marvel-filmene.",
  "personalityWorkStyle": "Personlighet og Arbeidsstil",
  "personalityWorkStyleText": "Ifølge personlighetstester er jeg både introvert og ekstrovert. I store grupper med ukjente mennesker observerer jeg helst, men i mindre kretser med kjente deltar jeg aktivt.\n\nJeg elsker å reparere ting, enten alene eller i team, og finner glede i å jobbe sammen med andre. En av de mest givende jobbene jeg har hatt var som lagermedhjelper, på grunn av de fantastiske kollegaene.",
  "goalsAmbitions": "Mål og Ambisjoner",
  "goalsAmbitionsText": "For fremtiden ønsker jeg stabilitet for meg og familien min. Jeg vil være en støttende far for mine barn gjennom deres oppvekst.\n\nJeg søker en arbeidsplass som er givende og oppmuntrende, hvor jeg selv kan bidra til et positivt arbeidsmiljø. Jeg ønsker å utvide min kompetanse innen backend-utvikling for å bli en fullstack-utvikler, og kanskje en dag skape den perfekte nettsiden som alle vil ha.",
  "motto": "Motto",
  "mottoText": "Mitt favoritt-motto er: \"I don't deal the cards, I just play them.\" Dette minner meg på å gjøre det beste ut av enhver situasjon.",
  "gallery": "Galleri",
  "welcome": "Velkommen til min hjemmeside!",
  "welcomeText": "Jeg er en entusiastisk og dedikert person, med spesialisering i frontend utvikling.\n\nJeg håper du finner informasjonen her nyttig og engasjerende. Føl deg fri til å utforske.",
  "thankYou": "Takk for at du kom!",
  "builtWith": "Bygget med",
  "links": "Lenker",
  "rainydays": {
    "description": "Det første prosjektet fra skolen som vi jobbet med det første året. Oppgaven var å lage en nettside for en fiktiv bedrift som solgte regntøy."
  },
  "csm": {
    "description": "For dette prosjektet fikk vi i oppgave å designe og utvikle en nettside for samfunnsvitenskapsmuseet. Målgruppen var barn i alderen 7-15 år. Vi fikk tekst og bilder, men farger, skrifttyper og design var opp til oss å lage og designe. Jeg valgte en fargepalett som gikk for et mørkt tema, men også med lyse og livlige farger, og for skrifttyper ønsket jeg å gå litt annerledes, så jeg parret Alegreya med Nunito med inspirasjon fra Figma-samfunnet."
  },
  "itt": {
    "description": "Dette er eksamensprosjektet mitt for det første året med frontend-utviklingsstudier. Det er en bloggside laget for dette formålet, og alt du leser og ser er fiktivt. Denne siden bruker WordPress REST API for å hente innholdet sitt. Dette prosjektet er laget for å vise frem ferdighetene og evnene vi har oppnådd i løpet av dette første året med studier."
  },
  "connotation": {
    "description": "Dette prosjektet er en utvidelse av en Bootstrap-oppgave der vi har integrert JavaScript for å forbedre funksjonaliteten til et sosialt medie-nettsted. Den opprinnelige oppgaven brukte primært Bootstrap, og vi har utvidet den ved å inkludere JavaScript-funksjoner."
  },
  "cyberstore": {
    "description": "Min første introduksjon til å bygge med React. Stylet med Styled-Components."
  },
  "adling": {
    "description": "Et morsomt prosjekt med en bot som henter stillingsannonser fra en nettside og legger dem ut på en Discord-server.",
    "demoNotes": "Satt opp for å fungere på min Discord-server. Vennligst les README.md for mer informasjon."
  },
  "flutter": {
    "description": "Et Pong-lignende spill jeg bygde med Flutter.",
    "demoNotes": "Krever nedlasting og utpakking av zip-filen. Kjør .exe-filen for å spille spillet."
  }
}
