{
  "frontend": "Front-End Developer",
  "Home": "Home",
  "About": "About Me",
  "Projects": "Projects",
  "Connect": "Connect",
  "connectWithMe": "Connect with me!",
  "Language": "Language",
  "aboutMe": "About Me",
  "aboutMeText": "Hi! My name is Hans Marius, but online I'm known as Spookyrumble. I am a passionate and dedicated person who greatly values both technology and human relationships.\n\nAlthough I am quite a private person, I am very open with my inner circle of friends and family. My children are a great inspiration to me. I learn a lot from observing how they approach the world with curiosity and openness. Their unreserved view of life motivates me to always strive to be a better version of myself.\n\nFriends would describe me as curious, motivated, and always ready to help. I believe in continuous learning and strive to improve myself every day, whether it's mastering a new programming language or exploring a new hobby. I am driven by a desire to innovate and make a positive impact through technology.",
  "careerBackground": "Career and Background",
  "careerBackgroundText": "I am a proactive Front-End developer with a passion for contributing innovative solutions and strengthening dynamic teams. Currently, I work as a student mentor at Noroff School of Technology and Digital Media, where I have the opportunity to enhance students' motivation and engagement through tailored mentoring styles. This role has provided me with valuable experience in motivating and guiding students.\n\nI possess a sharp eye for detail and excel in identifying issues and imperfections, skills I honed through my experience in car detailing. My background in customer service has equipped me with excellent communication skills, the ability to manage customer relations effectively, and a talent for accurate order processing and follow-up.\n\nAdditionally, I have experience in coordinating service teams and planning work efficiently, which has enhanced my leadership and organizational abilities. My roles in various customer-facing positions have also developed my capability to provide sales support, optimize revenue streams through precise billing, and ensure seamless day-to-day operations. These experiences have collectively endowed me with a versatile skill set in customer service, order management, and team leadership.",
  "educationSkills": "Education and Skills",
  "educationSkillsText": "I hold a Higher Professional Degree in frontend development from Noroff - School of Technology and Digital Media, where I combined visual design with coding, web development, and UX design. My education has provided me with a solid understanding of how to merge aesthetics and functionality in web design, and I have excelled in coding and UX design with a focus on user-friendly solutions.\n\nThrough my education and professional experience, I have developed the ability to work effectively both in teams and independently, and I am always looking for opportunities to grow professionally and develop deep knowledge in a collaborative work environment. My native language is Norwegian and I speak English fluently.",
  "interestsHobbies": "Interests and Hobbies",
  "interestsHobbiesText": "I love to travel and have visited all continents except Antarctica and South America. I find great joy in exploring new cultures and cuisines, which has broadened my perspective and enriched my life.\n\nOne of my biggest interests is cars, motorcycles, and Formula 1. I love the excitement and technology behind motorsports, and I spend a lot of time keeping up to date with everything happening in this fascinating world. Hunting, especially moose hunting, is a favorite activity, offering not only an exciting challenge but also an opportunity to connect with nature on a deeper level.\n\nThese days, I spend a lot of my time on technology, gaming, and coding. I am deeply engaged in creating innovative solutions and continually improving my skills in frontend development. Gaming is another significant interest, with a special love for role-playing and strategy games that offer complex worlds and intricate narratives. I am also a big fan of Star Wars and Marvel movies, appreciating their rich stories and expansive universes. Additionally, I enjoy spending time with my family and our two dogs, often going on trips and outdoor adventures. My hobbies reflect my love for both adventure and creativity, balancing physical activities with intellectual pursuits.",
  "personalityWorkStyle": "Personality and Work Style",
  "personalityWorkStyleText": "I am a person who values integrity and honesty in all aspects of life. I firmly believe that good manners and respect are fundamental values that foster positive relationships both at work and in private life. This approach makes me an empathetic and understanding colleague who is always willing to listen and contribute constructively to any collaboration.\n\nWhen it comes to my work style, I am highly detail-oriented and methodical. I like to work in a structured manner and always plan thoroughly to ensure that I deliver high-quality results in everything I do. My background as a frontend developer has taught me the importance of both aesthetics and functionality, and I strive to find the balance between these two aspects in my work.\n\nI thrive in dynamic teams where creativity and innovation are encouraged. At the same time, I have the ability to work independently and take responsibility for my own projects. I am always on the lookout for new challenges and learning opportunities, and I greatly appreciate a work environment where continuous professional development is a priority. My colleagues describe me as reliable, curious, and always ready to find creative solutions to complex problems.",
  "goalsAmbitions": "Goals and Ambitions",
  "goalsAmbitionsText": "My goals and aspirations are driven by a desire for continuous development and making a positive impact through technology. In the short term, I aim to further develop my skills as a Front-End developer and contribute to innovative projects that can enhance user experiences and solve complex problems. I look forward to taking on challenging tasks that can help me grow both professionally and personally.\n\nI have a strong interest in artificial intelligence (AI) and am eager to learn more about this field. I believe AI has the potential to revolutionize many aspects of our lives and I want to be at the forefront of this technological advancement. My goal is to integrate AI into my work, creating smarter and more efficient solutions.\n\nIn the long term, I aspire to take on leadership roles where I can inspire and guide other developers. I want to create an environment where the team can thrive, with a strong focus on creativity and innovation. Another long-term ambition is to contribute to community-beneficial projects, particularly those that make technology accessible and useful to more people. I am especially interested in working on projects that promote sustainability and social responsibility.\n\nMy ultimate dream is to be part of a company or organization at the forefront of technological innovation, where I can continue to learn and grow in a dynamic and supportive environment. I am motivated by the thought of using my skills to make a real difference and contribute to a better future through technology.",
  "motto": "Motto",
  "mottoText": "'I don't deal the cards, I just play them.' -This quote is often used in contexts where one makes the best out of situations beyond their control.\n\n'It's better to be a warrior in a garden than a gardener in a war.' - This quote, often attributed to Bruce Lee, reflects the philosophy of being prepared and strong, even in times of peace.",
  "gallery": "Gallery",
  "welcome": "Welcome!",
  "welcomeText": "On this page, you will find an overview of my projects, skills, and experiences. You can learn about my background, my goals, and future plans.\n\nDon't hesitate to get in touch if you have any questions or are interested in collaboration!",
  "explore": "Explore",
  "builtWith": "Built with",
  "links": "Links",
  "keyFeaturesHeader": "Key Features",
  "rainydays": {
    "description": "The first project from school that we worked on in the first year. The task was to create a website for a fictional company that sold rainwear.",
    "keyFeatures": [
      "First-year school project",
      "Website for a fictional rainwear company",
      "Focus on web development basics"
    ]
  },
  "csm": {
    "description": "For this project we were tasked to design and develop a web page for the community science museum. Targeting ages 7-15 year olds. We were given text and images but colors, fonts and design was all up to us to create and design. I chose a color palette going for a dark theme but also with bright and vivid colors and for fonts I wanted to go a bit different so I paired Alegreya with Nunito with inspiration from the Figma community.",
    "keyFeatures": [
      "Web page for Community Science Museum",
      "Target audience: 7-15 year olds",
      "Custom color palette and font selection",
      "Dark theme with bright and vivid colors",
      "Fonts: Alegreya and Nunito"
    ]
  },
  "itt": {
    "description": "This is my exam project for my first year front-end development studies. It is a blog page created for this reason and everything you read and see is fictional. This site uses wordpress REST API to fetch its content. This project is made to showcase the capabilities and skills we have acquired over this first year of studies.",
    "keyFeatures": [
      "First-year exam project",
      "Blog page",
      "Uses WordPress REST API",
      "Showcases acquired skills and capabilities",
      "Commenting"
    ]
  },
  "connotation": {
    "description": "This project is an extension of a Bootstrap assignment where we have integrated JavaScript to enhance the functionality of a social media website. The original assignment primarily utilized Bootstrap, and we have extended it by incorporating JavaScript features.",
    "demoNotes": "NB! Requires a login. Use email: invitedguest@noroff.no, Password: socialmedia",
    "keyFeatures": [
      "Bootstrap assignment extension",
      "Enhanced with JavaScript",
      "Social media website functionality",
      "Requires login for demo",
      "Commenting",
      "Reactions",
      "Follow/Unfollow",
      "Posting"
    ]
  },
  "onlypineapples": {
    "description": "An auction site built using Bootstrap and SASS. The task was to create an auction site with bidding functionality. This project also includes unit testing with Jest and E2E testing.",
    "demoNotes": "NB! Requires a login. Use email: invitedguest@noroff.no, Password: auctionhouse",
    "keyFeatures": [
      "Auction site",
      "Built with Bootstrap and SASS",
      "Includes unit testing with Jest and E2E testing",
      "Bidding functionality",
      "Requires login for demo",
      "Post listings",
      "Edit profile"
    ]
  },
  "cyberstore": {
    "description": "My first introduction to building with React. The task was to create an e-commerce site that fetches data with an API and has all the functionalities of an online store, including product search and shopping cart. This project provided a thorough understanding of React and its ecosystem. Styled with Styled-Components to ensure a modern and responsive design. The project also required handling product data through APIs.",
    "keyFeatures": [
      "First project with React",
      "Styled with Styled-Components",
      "Shopping cart functionality",
      "Search functionality",
      "API integration"
    ]
  },
  "adling": {
    "description": "I saw a need for the community server I manage. I wanted a channel that showed new job listings within development, so I built this bot to do just that. Technically, it's a web scraper, but it only fetches open data and adheres to rules and regulations. It is configured to check twice a day. To keep track of the data, it saves new links to listings in a JSON file that the bot then checks the status of. If they are new, they are shared, and 'posted' is set to false so they are not shared more than once. A script is created to purge old links after a selected period.",
    "demoNotes": "Set up to work on my Discord server. Please read README.md for more information.",
    "keyFeatures": [
      "Bot for pulling job listings",
      "Posts to a Discord server",
      "Requires setup on Discord server"
    ]
  },
  "flutter": {
    "description": "A Pong-like game I built using Flutter. This was a side project I did privately in connection with a case study we conducted for school.",
    "demoNotes": "Requires downloading and unzipping the file. Run the .exe file to play the game.",
    "keyFeatures": [
      "Pong-like game",
      "Built using Flutter",
      "Executable file for gameplay"
    ]
  },
  "havens": {
    "description": "Havens is an ambitious project developed as part of the Front-End Development examination at Noroff. The assignment was to build an accommodation application, showcasing advanced proficiency in web development while leveraging modern tools and frameworks. The primary goal of Havens is to integrate the skills and knowledge acquired over the last two years into a comprehensive and practical application. This project not only highlights the ability to build responsive and user-friendly interfaces but also demonstrates effective problem-solving, project management, and the application of best practices in coding and design. Through Havens, the aim is to create a seamless and engaging user experience, reflecting the culmination of extensive learning and hands-on experience in front-end development.",
    "demoNotes": "NB! Requires login. Use email: invitedguest@stud.noroff.no, Password: 1Havenshavens",
    "keyFeatures": [
      "Front-End Development examination project",
      "Demonstrates proficiency in modern web tools and frameworks",
      "Extensive project showcasing two years of skills",
      "Requires login for demo",
      "Booking functionality",
      "Add venues",
      "Edit venues",
      "Delete venues",
      "View and delete bookings on own venues",
      "View venues on other profiles",
      "Search functionality"
    ]
  }
}
