{
  "frontend": "Front-End Developer",
  "Home": "Home",
  "About": "About Me",
  "Projects": "Projects",
  "Connect": "Connect",
  "connectWithMe": "Connect with me",
  "Language": "Language",
  "aboutMe": "About Me",
  "aboutMeText": "Hi! My name is Hans Marius, but online I'm known as Spookyrumble. I am a passionate and dedicated person who highly values both technology and human relationships.\n\nOne of my biggest interests is cars, motorcycles, and Formula 1. I love the excitement and technology behind motorsports, and I spend a lot of time staying updated on everything happening in this fascinating world.\n\nFor me, politeness and respect for others are very important. I believe that one should always be careful about assuming what others have been through. This makes me an objective and understanding person who always tries to see things from others' perspectives. I believe that most people are good and that everyone deserves respect.\n\nAlthough I am a rather private person, I am very open with my inner circle of friends and family. My children are a great inspiration to me. I learn a lot by observing how they approach the world with curiosity and openness. Their unreserved view of life motivates me to always strive to be a better version of myself.\n\nFriends would describe me as curious, motivated, and always ready to help. I believe in continuous learning and strive to improve myself every day, whether it is mastering a new programming language or exploring a new hobby. I am driven by a desire to innovate and make a positive impact through technology.",
  "careerBackground": "Career and Background",
  "careerBackgroundText": "I am a proactive Front-End developer with a passion for contributing innovative solutions and strengthening dynamic teams. Currently, I work as a student mentor at Noroff Fagskole, where I have the opportunity to enhance students' motivation and engagement through tailored mentoring styles. This role has provided me with valuable experience in motivating and guiding students.\n\nPreviously, I worked as a car detailing technician and customer advisor at Laastad & Co, where I was qualified in paint preservation and ceramic coating application. I also have experience as a customer advisor at Tollaksen Autoservice AS, where I was the primary contact point for workshop customers and responsible for accurate order processing and follow-up.\n\nMy experience also includes the role of service coordinator at Hybeko-Forland AS, where I led customer contact and work planning for the service team, as well as a customer advisor at Motorforum Bergen AS, where I provided sales support and optimized revenue streams through precise billing and day planning. These roles have equipped me with a wide range of skills in customer service, order processing, and team leadership.",
  "educationSkills": "Education and Skills",
  "educationSkillsText": "I hold a Higher Professional Degree in Front-End development from Noroff - School of Technology and Digital Media, where I combined visual design with coding, web development, and UX design. My education has provided me with a solid understanding of how to combine aesthetics and functionality in web design, and I have excelled in coding and UX design with a focus on user-friendly solutions.\n\nMy skills include Front-End development, customer service, and automotive maintenance. I am also fluent in both Norwegian and English. Through my education and professional experience, I have developed the ability to work effectively both in teams and independently, and I am always looking for opportunities to grow professionally and develop in-depth knowledge in a collaborative work environment.",
  "interestsHobbies": "Interests and Hobbies",
  "interestsHobbiesText": "I love traveling and have visited all continents except Antarctica and South America. I find great joy in exploring new cultures and cuisines, which has broadened my perspective and enriched my life. Elk hunting is a favorite activity, providing not only an exhilarating challenge but also an opportunity to connect with nature on a deeper level. I used to snowboard a lot, enjoying the thrill and freedom of gliding down snowy slopes.\n\nNowadays, I spend much of my time on technology, gaming, and coding. I am deeply passionate about creating innovative solutions and continuously improving my skills in frontend development. Gaming is another significant interest, with a particular fondness for role-playing and strategy games that offer complex worlds and intricate narratives. I am also a big fan of Star Wars and Marvel movies, appreciating their rich stories and expansive universes. Additionally, I enjoy spending time with my family and our two dogs, often going on hikes and outdoor adventures. My hobbies reflect my love for both adventure and creativity, balancing physical activities with intellectual pursuits.",
  "personalityWorkStyle": "Personality and Work Style",
  "personalityWorkStyleText": "I am a person who values integrity and honesty in all aspects of life. I firmly believe that good manners and respect are fundamental values that foster positive relationships both at work and in private life. This approach makes me an empathetic and understanding colleague who is always willing to listen and contribute constructively to any collaboration.\n\nWhen it comes to my work style, I am highly detail-oriented and methodical. I like to work in a structured manner and always plan thoroughly to ensure that I deliver high-quality results in everything I do. My background as a frontend developer has taught me the importance of both aesthetics and functionality, and I strive to find the balance between these two aspects in my work.\n\nI thrive in dynamic teams where creativity and innovation are encouraged. At the same time, I have the ability to work independently and take responsibility for my own projects. I am always on the lookout for new challenges and learning opportunities, and I greatly appreciate a work environment where continuous professional development is a priority. My colleagues describe me as reliable, curious, and always ready to find creative solutions to complex problems.",
  "goalsAmbitions": "Goals and Ambitions",
  "goalsAmbitionsText": "For the future, I want stability for myself and my family. I want to be a supportive father for my children throughout their upbringing.\n\nI seek a workplace that is rewarding and encouraging, where I can contribute to a positive work environment. I aim to expand my knowledge in backend development to become a full-stack developer, and perhaps one day create the perfect website that everyone needs.",
  "motto": "Motto",
  "mottoText": "My favorite motto is: \"I don't deal the cards, I just play them.\" This reminds me to make the best of any situation.",
  "gallery": "Gallery",
  "welcome": "Welcome to my homepage!",
  "welcomeText": "I am an enthusiastic and dedicated person, specializing in Front-End Development.\n\nI hope you find the information here useful and engaging. Feel free to explore.",
  "thankYou": "Thank you for visiting!",
  "builtWith": "Built with",
  "links": "Links",
  "rainydays": {
    "description": "The first project from school that we worked on in the first year. The task was to create a website for a fictional company that sold rainwear."
  },
  "csm": {
    "description": "For this project we were tasked to design and develop a web page for the community science museum. Targeting ages 7-15 year olds. We were given text and images but colors, fonts and design was all up to us to create and design. I chose a color palette going for a dark theme but also with bright and vivid colors and for fonts I wanted to go a bit different so I paired Alegreya with Nunito with inspiration from the Figma community."
  },
  "itt": {
    "description": "This is my exam project for my first year front-end development studies. It is a blog page created for this reason and everything you read and see is fictional. This site uses wordpress REST API to fetch its content. This project is made to showcase the capabilities and skills we have acquired over this first year of studies."
  },
  "connotation": {
    "description": "This project is an extension of a Bootstrap assignment where we have integrated JavaScript to enhance the functionality of a social media website. The original assignment primarily utilized Bootstrap, and we have extended it by incorporating JavaScript features.",
    "demoNotes": "NB! Requires a login. Use email: invitedguest@noroff.no, Password: socialmedia"
  },
  "onlypineapples": {
    "description": "An Auction site built using Bootstrap and SASS. This project also has Jest Unit testing and E2E testing.",
    "demoNotes": "NB! Requires a login. Use email: invitedguest@noroff.no, Password: auctionhouse"
  },
  "cyberstore": {
    "description": "My first introduction to building with React. Styled with Styled-Components."
  },
  "adling": {
    "description": "A fun project bot that pulls job listings from a website and posts them to a Discord server.",
    "demoNotes": "Set up to work on my discord server. Please read README.md for more information."
  },
  "flutter": {
    "description": "A Pong-like game I built using Flutter.",
    "demoNotes": "Requires download and unpacking of the zip file. Run the .exe file to play the game."
  },
  "havens": {
    "description": "Havens er et prosjekt utviklet som en del av eksamen i Front-End Development. Prosjektet har som mål å demonstrere ferdigheter i webutvikling ved bruk av moderne verktøy og rammeverk, og å anvende ferdighetene lært over de siste to årene i et omfattende prosjekt.",
    "demoNotes": "NB! Krever innlogging. Bruk e-post: invitedguest@stud.noroff.no, Passord: 1Havenshavens"
  }
}
