{
  "frontend": "Front-End Developer",
  "Home": "Home",
  "About": "About Me",
  "Projects": "Projects",
  "Connect": "Connect",
  "Language": "Language",
  "aboutMe": "About Me",
  "aboutMeText": "Hi! My name is Hans Marius, but online, I am known as Spookyrumble. I am an enthusiastic and dedicated person working part-time as a student mentor at Noroff, a job I got while studying Front-End development at Noroff. I have a passion for technology and enjoy solving complex problems through creative coding solutions.\n\nOutside of work and studies, I am an avid gamer, particularly enjoying RPGs and strategy games. I love immersing myself in new game worlds and experiencing their stories and challenges. In addition to gaming, I enjoy hiking and spending time in nature, where I find peace and inspiration.\n\nFamily is a big part of my life. I have a wonderful wife, and together we have three daughters and two dogs. Much of my time is spent with my family, enjoying activities and creating memories together.\n\nMy friends would describe me as curious, motivated, and always ready to lend a helping hand. I believe in continuous learning and strive to improve myself every day, whether it's mastering a new programming language or exploring a new hobby. I am driven by a desire to innovate and make a positive impact through technology.",
  "careerBackground": "Career and Background",
  "careerBackgroundText": "I am currently working as a student mentor at Noroff, where I assist other students in navigating their studies and developing skills in Front-End development. In this role, I have developed strong mentoring and guidance skills, and I have gained experience in providing technical support and educational guidance.\n\nI have also completed several courses in customer advisory, which has given me valuable experience in customer service and communication. Previously, I have worked in the automotive industry since 2003, where I have held various roles, from mechanic and car detailer to customer service and the parts department. This broad experience has developed my technical skills and ability to handle complex problems effectively.\n\nMy experience in customer service has enabled me to communicate effectively with customers, understand their needs, and provide solutions that meet their requirements. Over the years, I have developed a strong logical and objective approach to problem-solving, and I am proficient at troubleshooting and finding solutions to technical challenges.\n\nI am also the vice-chairman of my daughter's karate club, where I contribute to the club's future plans and development. This engagement has further strengthened my leadership skills and ability to work in a team.",
  "educationSkills": "Education and Skills",
  "educationSkillsText": "I have a general education background and a higher vocational degree in Front-End development. I approach problem-solving logically and objectively, and I am skilled at troubleshooting and finding solutions to technical challenges.\n\nI am also the student representative for Front-End development at Noroff, where I represent my fellow students and contribute to improvements in the study program.",
  "interestsHobbies": "Interests and Hobbies",
  "interestsHobbiesText": "I love traveling and have visited all continents except Antarctica and South America. Elk hunting is a favorite activity, and I used to snowboard a lot.\n\nNowadays, I spend much of my time on technology, gaming, and coding. I am also a big fan of Star Wars and Marvel movies.",
  "personalityWorkStyle": "Personality and Work Style",
  "personalityWorkStyleText": "According to personality tests, I am both introverted and extroverted. In large groups of strangers, I prefer to observe, but in smaller circles with people I know, I actively participate.\n\nI love fixing things, whether alone or in a team, and find joy in working with others. One of the most rewarding jobs I've had was as a warehouse assistant, thanks to the great colleagues.",
  "goalsAmbitions": "Goals and Ambitions",
  "goalsAmbitionsText": "For the future, I want stability for myself and my family. I want to be a supportive father for my children throughout their upbringing.\n\nI seek a workplace that is rewarding and encouraging, where I can contribute to a positive work environment. I aim to expand my knowledge in backend development to become a full-stack developer, and perhaps one day create the perfect website that everyone needs.",
  "motto": "Motto",
  "mottoText": "My favorite motto is: \"I don't deal the cards, I just play them.\" This reminds me to make the best of any situation.",
  "gallery": "Gallery",
  "welcome": "Welcome to my homepage!",
  "welcomeText": "I am an enthusiastic and dedicated person, specializing in Front-End Development.\n\nI hope you find the information here useful and engaging. Feel free to explore.",
  "thankYou": "Thank you for visiting!",
  "builtWith": "Built with",
  "links": "Links",
  "rainydays": {
    "description": "The first project from school that we worked on in the first year. The task was to create a website for a fictional company that sold rainwear."
  },
  "csm": {
    "description": "For this project we were tasked to design and develop a web page for the community science museum. Targeting ages 7-15 year olds. We were given text and images but colors, fonts and design was all up to us to create and design. I chose a color palette going for a dark theme but also with bright and vivid colors and for fonts I wanted to go a bit different so I paired Alegreya with Nunito with inspiration from the Figma community."
  },
  "itt": {
    "description": "This is my exam project for my first year front-end development studies. It is a blog page created for this reason and everything you read and see is fictional. This site uses wordpress REST API to fetch its content. This project is made to showcase the capabilities and skills we have acquired over this first year of studies."
  },
  "connotation": {
    "description": "This project is an extension of a Bootstrap assignment where we have integrated JavaScript to enhance the functionality of a social media website. The original assignment primarily utilized Bootstrap, and we have extended it by incorporating JavaScript features.",
    "demoNotes": "NB! Requires a login. Use email: invitedguest@noroff.no, Password: socialmedia"
  },
  "onlypineapples": {
    "description": "An Auction site built using Bootstrap and SASS. This project also has Jest Unit testing and E2E testing.",
    "demoNotes": "NB! Requires a login. Use email: invitedguest@noroff.no, Password: auctionhouse"
  },
  "cyberstore": {
    "description": "My first introduction to building with React. Styled with Styled-Components."
  },
  "adling": {
    "description": "A fun project bot that pulls job listings from a website and posts them to a Discord server.",
    "demoNotes": "Set up to work on my discord server. Please read README.md for more information."
  },
  "flutter": {
    "description": "A Pong-like game I built using Flutter.",
    "demoNotes": "Requires download and unpacking of the zip file. Run the .exe file to play the game."
  },
  "havens": {
    "description": "Havens er et prosjekt utviklet som en del av eksamen i Front-End Development. Prosjektet har som mål å demonstrere ferdigheter i webutvikling ved bruk av moderne verktøy og rammeverk, og å anvende ferdighetene lært over de siste to årene i et omfattende prosjekt.",
    "demoNotes": "NB! Krever innlogging. Bruk e-post: invitedguest@stud.noroff.no, Passord: 1Havenshavens"
  }
}
